In [1]:
# 10分钟了解pandas
# 简短介绍pandas,主要对新手。提升可以参考cookbook
# http://pandas.pydata.org/pandas-docs/stable/10min.html

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
import matplotlib.pyplot as plt

> 创建对象  --- Series

1,通过列表创建，pandas默认会创建一个整形的索引

In [5]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

>创建对象 -- DataFrame

1,通过numpy array 创建 DF 对象

In [6]:
#使用时间戳做索引
dates = pd.date_range('20180304',periods=6)
dates

DatetimeIndex(['2018-03-04', '2018-03-05', '2018-03-06', '2018-03-07',
               '2018-03-08', '2018-03-09'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
df

                   A         B         C         D
2018-03-04 -1.730891 -0.373285 -0.748236  0.171053
2018-03-05  0.564094  0.179297  1.526215 -0.544694
2018-03-06 -2.337297 -0.451765  1.505203  0.431509
2018-03-07 -1.390504  0.321133 -0.614634 -2.567166
2018-03-08  0.221017  0.678076 -0.263141 -0.474254
2018-03-09  0.087726 -0.583678  0.178581  0.984640

2,通过字典创建DataFrame

In [11]:
df2 = pd.DataFrame({'A':1,
                    'B':pd.Timestamp('20180102'),
                    'C':pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D':np.array([3]*4,dtype='int32'),
                    'E':pd.Categorical(['test','train','test','train']),
                    'F':'foo'})

In [12]:
df2

   A          B    C  D      E    F
0  1 2018-01-02  1.0  3   test  foo
1  1 2018-01-02  1.0  3  train  foo
2  1 2018-01-02  1.0  3   test  foo
3  1 2018-01-02  1.0  3  train  foo

如果使用IPython，可以通过对象.TAB 查看该对象所有方法
df2.<TAB>

> 查看数据/展示数据

查看数据头部和尾部 --- head and tail

In [16]:
df.head()

                   A         B         C         D
2018-03-04 -1.730891 -0.373285 -0.748236  0.171053
2018-03-05  0.564094  0.179297  1.526215 -0.544694
2018-03-06 -2.337297 -0.451765  1.505203  0.431509
2018-03-07 -1.390504  0.321133 -0.614634 -2.567166
2018-03-08  0.221017  0.678076 -0.263141 -0.474254

In [17]:
df.tail(2)

                   A         B         C         D
2018-03-08  0.221017  0.678076 -0.263141 -0.474254
2018-03-09  0.087726 -0.583678  0.178581  0.984640

展示数据索引和列名和底层numpy数据  --- .index/.columns/.values

In [20]:
df.index

DatetimeIndex(['2018-03-04', '2018-03-05', '2018-03-06', '2018-03-07',
               '2018-03-08', '2018-03-09'],
              dtype='datetime64[ns]', freq='D')

In [21]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [22]:
df.values

array([[-1.73089115, -0.37328527, -0.7482362 ,  0.17105322],
       [ 0.56409438,  0.17929695,  1.52621535, -0.54469394],
       [-2.33729659, -0.45176457,  1.50520327,  0.43150876],
       [-1.39050356,  0.32113337, -0.61463381, -2.56716606],
       [ 0.22101706,  0.67807613, -0.26314081, -0.47425399],
       [ 0.08772621, -0.58367804,  0.17858123,  0.98464024]])

describe() 快速展示了数据的一些基本统计信息

In [23]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.764309 -0.038370  0.263998 -0.333152
std    1.205170  0.504052  1.021329  1.235393
min   -2.337297 -0.583678 -0.748236 -2.567166
25%   -1.645794 -0.432145 -0.526761 -0.527084
50%   -0.651389 -0.096994 -0.042280 -0.151600
75%    0.187694  0.285674  1.173548  0.366395
max    0.564094  0.678076  1.526215  0.984640

Transposing  -- 转置

In [24]:
df.T

   2018-03-04  2018-03-05  2018-03-06  2018-03-07  2018-03-08  2018-03-09
A   -1.730891    0.564094   -2.337297   -1.390504    0.221017    0.087726
B   -0.373285    0.179297   -0.451765    0.321133    0.678076   -0.583678
C   -0.748236    1.526215    1.505203   -0.614634   -0.263141    0.178581
D    0.171053   -0.544694    0.431509   -2.567166   -0.474254    0.984640

Sorting by an axis   --- 一个轴排序

In [25]:
df.sort_index(axis=1,ascending=False)  #  按轴排序 -- 1 列名 ascending  升序

                   D         C         B         A
2018-03-04  0.171053 -0.748236 -0.373285 -1.730891
2018-03-05 -0.544694  1.526215  0.179297  0.564094
2018-03-06  0.431509  1.505203 -0.451765 -2.337297
2018-03-07 -2.567166 -0.614634  0.321133 -1.390504
2018-03-08 -0.474254 -0.263141  0.678076  0.221017
2018-03-09  0.984640  0.178581 -0.583678  0.087726

In [26]:
df.sort_values(by='B')   # 按值排序   默认升序

                   A         B         C         D
2018-03-09  0.087726 -0.583678  0.178581  0.984640
2018-03-06 -2.337297 -0.451765  1.505203  0.431509
2018-03-04 -1.730891 -0.373285 -0.748236  0.171053
2018-03-05  0.564094  0.179297  1.526215 -0.544694
2018-03-07 -1.390504  0.321133 -0.614634 -2.567166
2018-03-08  0.221017  0.678076 -0.263141 -0.474254

> 数据--查询  -- selection

.at, .iat, .loc, .iloc

> 获取数据

In [29]:
df['A']  # 使用列名/字段 by field --- 返回 Series -- 等价 df.A

2018-03-04   -1.730891
2018-03-05    0.564094
2018-03-06   -2.337297
2018-03-07   -1.390504
2018-03-08    0.221017
2018-03-09    0.087726
Freq: D, Name: A, dtype: float64

In [30]:
df[0:3]  # 使用[]切片

                   A         B         C         D
2018-03-04 -1.730891 -0.373285 -0.748236  0.171053
2018-03-05  0.564094  0.179297  1.526215 -0.544694
2018-03-06 -2.337297 -0.451765  1.505203  0.431509

In [31]:
df['20180305':'20180308']

                   A         B         C         D
2018-03-05  0.564094  0.179297  1.526215 -0.544694
2018-03-06 -2.337297 -0.451765  1.505203  0.431509
2018-03-07 -1.390504  0.321133 -0.614634 -2.567166
2018-03-08  0.221017  0.678076 -0.263141 -0.474254

 -- by label

In [32]:
df.loc[dates[0]]

A   -1.730891
B   -0.373285
C   -0.748236
D    0.171053
Name: 2018-03-04 00:00:00, dtype: float64

In [34]:
df.loc['20180305':'20180307',['A','B']]  # 多维度取数据

                   A         B
2018-03-05  0.564094  0.179297
2018-03-06 -2.337297 -0.451765
2018-03-07 -1.390504  0.321133

In [36]:
df.loc['20180305',['A','B']]  # 默认归并了  reduction

A    0.564094
B    0.179297
Name: 2018-03-05 00:00:00, dtype: float64

In [39]:
df.at[dates[0],'A']   # 快速获取标量 --？？？

-1.7308911505415316

by 位置

In [40]:
df.iloc[3]

A   -1.390504
B    0.321133
C   -0.614634
D   -2.567166
Name: 2018-03-07 00:00:00, dtype: float64

In [41]:
df.iloc[3:5,0:2]

                   A         B
2018-03-07 -1.390504  0.321133
2018-03-08  0.221017  0.678076

In [42]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2018-03-05  0.564094  1.526215
2018-03-06 -2.337297  1.505203
2018-03-08  0.221017 -0.263141

In [43]:
df.iloc[1:3,:]

                   A         B         C         D
2018-03-05  0.564094  0.179297  1.526215 -0.544694
2018-03-06 -2.337297 -0.451765  1.505203  0.431509

In [44]:
df.iloc[:,1:3]

                   B         C
2018-03-04 -0.373285 -0.748236
2018-03-05  0.179297  1.526215
2018-03-06 -0.451765  1.505203
2018-03-07  0.321133 -0.614634
2018-03-08  0.678076 -0.263141
2018-03-09 -0.583678  0.178581

In [45]:
df.iat[1,1]       # 快速访问标量

0.17929695142913993

boolean 索引 取值

In [47]:
df[df.A>0]

                   A         B         C         D
2018-03-05  0.564094  0.179297  1.526215 -0.544694
2018-03-08  0.221017  0.678076 -0.263141 -0.474254
2018-03-09  0.087726 -0.583678  0.178581  0.984640

In [48]:
df[df>0]

                   A         B         C         D
2018-03-04       NaN       NaN       NaN  0.171053
2018-03-05  0.564094  0.179297  1.526215       NaN
2018-03-06       NaN       NaN  1.505203  0.431509
2018-03-07       NaN  0.321133       NaN       NaN
2018-03-08  0.221017  0.678076       NaN       NaN
2018-03-09  0.087726       NaN  0.178581  0.984640

In [52]:
df2 = df.copy()

In [53]:
df2['E'] = ['one','one','two','three','four','three']

In [54]:
df2

                   A         B         C         D      E
2018-03-04 -1.730891 -0.373285 -0.748236  0.171053    one
2018-03-05  0.564094  0.179297  1.526215 -0.544694    one
2018-03-06 -2.337297 -0.451765  1.505203  0.431509    two
2018-03-07 -1.390504  0.321133 -0.614634 -2.567166  three
2018-03-08  0.221017  0.678076 -0.263141 -0.474254   four
2018-03-09  0.087726 -0.583678  0.178581  0.984640  three

In [56]:
df2[df2['E'].isin(['two','four'])]    # isin过滤

                   A         B         C         D     E
2018-03-06 -2.337297 -0.451765  1.505203  0.431509   two
2018-03-08  0.221017  0.678076 -0.263141 -0.474254  four